/**
 * 2019年移动提供数据
 */
export default {
    getRawPoints() {
        //原始提供的字符串数据
        var theRawPointsString = "JiaoTong0002;交通;JTT铁路—铁路（高铁）;潮州;潮汕站;hotareapolygon =MULTIPOLYGON((（116.589239,23.547882,116.595887,23.54987,116.598617,23.543244,116.591826,23.541157,116.589239,23.547882,)));!\n" +
            "JiaoTong0005;交通;JTT公路—客运站;潮州;潮州汽车客运站;hotareapolygon =MULTIPOLYGON((（116.641775,23.672806,116.642655,23.67236,116.642853,23.671847,116.642511,23.6714,116.638738,23.670142,116.638235,23.671516,116.641775,23.672806,)));!\n" +
            "\"JiaoTong0006;交通;JTT公路—高速;东莞;莞佛高速虎门大桥;hotareapolygon =MULTIPOLYGON((（113.647794,22.814791,113.59404,22.781474,113.591021,22.771211,113.596627,22.770945,113.650238,22.809195,113.647794,22.814791,\n" +
            ")));!\"\n" +
            "JiaoTong0012;交通;JTT铁路—铁路（高铁）;东莞;东莞站;hotareapolygon =MULTIPOLYGON((（113.864391,23.09867,113.864122,23.09631,113.86211,23.0938,113.866368,23.089827,113.871326,23.094415,113.868021,23.097407,113.864391,23.09867,)));!\n" +
            "JiaoTong0019;交通;JTT铁路—铁路（高铁）;东莞;东莞东;hotareapolygon =MULTIPOLYGON((（114.043585,22.975014,114.049532,22.974282,114.049514,22.972053,114.042489,22.970423,114.043585,22.975014,)));!\n" +
            "JiaoTong0020;交通;JTT铁路—铁路（高铁）;东莞;虎门站;hotareapolygon =MULTIPOLYGON((（113.676875,22.866951,113.6793,22.86442,113.682804,22.864936,113.68151,22.869548,113.676857,22.866951,)));!\n" +
            "JiaoTong0026;交通;JTT公路—客运站;东莞;东莞汽车总站;hotareapolygon =MULTIPOLYGON((（113.72109,23.03835,113.722024,23.034692,113.724072,23.031964,113.726821,23.033827,113.725833,23.035723,113.725671,23.038084,113.723857,23.039032,113.72109,23.03835,)));!\n" +
            "JiaoTong0027;交通;JTT公路—客运站;东莞;东莞长安车站;hotareapolygon =MULTIPOLYGON((（113.826818,22.808085,113.826818,22.805603,113.83095,22.805736,113.829207,22.808101,113.826818,22.808085,)));!\n" +
            "JiaoTong0028;交通;JTT公路—服务区;佛山;勒流服务区-向东;hotareapolygon =MULTIPOLYGON((（113.16843,22.846732,113.174269,22.848722,113.172994,22.847123,113.17064,22.84644,113.16843,22.846732,)));!\n" +
            "JiaoTong0029;交通;JTT公路—服务区;佛山;勒流服务区-向西;hotareapolygon =MULTIPOLYGON((（113.168215,22.847098,113.170047,22.849113,113.173479,22.849962,113.17506,22.849296,113.168215,22.847098,)));!\n" +
            "JiaoTong0030;交通;JTT公路—服务区;佛山;顺德服务区-向北;hotareapolygon =MULTIPOLYGON((（113.274859,22.925126,113.275874,22.925476,113.27901,22.922538,113.277204,22.920732,113.274859,22.925126,)));!\n" +
            "JiaoTong0031;交通;JTT公路—服务区;佛山;顺德服务区-向南;hotareapolygon =MULTIPOLYGON((（113.274886,22.924527,113.273503,22.923595,113.274725,22.921049,113.277258,22.919934,113.274886,22.924527,)));!\n" +
            "JiaoTong0032;交通;JTT铁路—铁路（高铁）;佛山;佛山西站;hotareapolygon =MULTIPOLYGON((（113.034691,23.087028,113.035769,23.082323,113.045219,23.084069,113.044088,23.088723,113.034691,23.087028,)));!\n" +
            "JiaoTong0049;交通;JTT公路—客运站;佛山;佛山汽车站;hotareapolygon =MULTIPOLYGON((（113.116886,23.048206,113.116661,23.046286,113.11888,23.045804,113.119383,23.047866,113.116886,23.048206,)));!\n" +
            "JiaoTong0050;交通;JTT公路—收费站;佛山;勒流收费站;hotareapolygon =MULTIPOLYGON((（113.189531,22.855363,113.202449,22.857345,113.205323,22.845022,113.191238,22.842691,113.189531,22.855363,)));!\n" +
            "JiaoTong0051;交通;JTT公路—收费站;佛山;佛山罗格收费站;hotareapolygon =MULTIPOLYGON((（113.017846,22.998103,113.017595,22.996473,113.01993,22.995807,113.020182,22.99767,113.017846,22.998103,)));!\n" +
            "JiaoTong0073;交通;JTT公路—服务区;广州;沙埔服务区-向西;hotareapolygon =MULTIPOLYGON((（113.680366,23.195235,113.681327,23.193815,113.685432,23.195883,113.684525,23.196921,113.680366,23.195235,)));!\n" +
            "JiaoTong0074;交通;JTT公路—服务区;广州;沙埔服务区-向东;hotareapolygon =MULTIPOLYGON((（113.67909,23.192329,113.681291,23.191324,113.684283,23.193483,113.685028,23.195385,113.67909,23.192329,)));!\n" +
            "JiaoTong0075;交通;JTT公路—服务区;广州;广州花城服务区-向南;hotareapolygon =MULTIPOLYGON((（113.318531,23.510882,113.321702,23.510534,113.321038,23.506491,113.318091,23.506731,113.318531,23.510882,)));!\n" +
            "JiaoTong0076;交通;JTT公路—高速;广州;广佛高速沙贝立交;hotareapolygon =MULTIPOLYGON((（113.203214,23.163862,113.208568,23.163995,113.208496,23.158379,113.202962,23.158579,113.203214,23.163862,)));!\n" +
            "JiaoTong0077;交通;JTT公路—高速;广州;沈海高速广州黄村立交;hotareapolygon =MULTIPOLYGON((（113.411962,23.139007,113.414621,23.138541,113.414316,23.136032,113.411729,23.136331,113.411944,23.138957,)));!\n" +
            "JiaoTong0085;交通;JTT铁路—铁路（高铁）;广州;广州北站;hotareapolygon =MULTIPOLYGON((（113.208417,23.384938,113.210824,23.38556,113.212118,23.381729,113.209602,23.380908,113.208417,23.384938,)));!\n" +
            "JiaoTong0086;交通;JTT铁路—铁路（高铁）;广州;广州南站;hotareapolygon =MULTIPOLYGON((（113.277609,23.001437,113.267548,22.995083,113.271968,22.987764,113.283322,22.993653,113.277609,23.001437,)));!\n" +
            "JiaoTong0089;交通;JTT铁路—铁路（普通火车）;广州;广州火车站;hotareapolygon =MULTIPOLYGON((（113.259932,23.158079,113.261891,23.154274,113.267945,23.152264,113.26861,23.155205,113.259932,23.158079,)));!\n" +
            "JiaoTong0090;交通;JTT民航—机场;广州;广州白云国际机场;hotareapolygon =MULTIPOLYGON((（113.301062,23.432555,113.284389,23.373919,113.33182,23.36118,113.34993,23.42526,113.301062,23.432555,)));!\n" +
            "JiaoTong0091;交通;JTT民航—机场;广州;白云国际机场二号航站楼;hotareapolygon =MULTIPOLYGON((（113.305374,23.413455,113.299122,23.395678,113.326071,23.389177,113.331101,23.408547,113.305374,23.413455,)));!\n" +
            "JiaoTong0092;民航;JTT民航—机场;机场;白云国际机场二号航站楼1F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0093;民航;JTT民航—机场;机场;白云国际机场二号航站楼2F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0094;民航;JTT民航—机场;机场;白云国际机场二号航站楼3F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0095;民航;JTT民航—机场;机场;白云国际机场二号航站楼4F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0096;民航;JTT民航—机场;机场;广州白云国际机场B1;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0097;民航;JTT民航—机场;机场;广州白云国际机场1F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0098;民航;JTT民航—机场;机场;广州白云国际机场2F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0099;民航;JTT民航—机场;机场;广州白云国际机场3F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0100;交通;JTT公路—客运站;广州;省汽车客运站;hotareapolygon =MULTIPOLYGON((（113.257269,23.154492,113.257507,23.153541,113.259793,23.154064,113.259551,23.155493,113.257269,23.154492,)));!\n" +
            "JiaoTong0101;交通;JTT公路—客运站;广州;广州汽车客运站;hotareapolygon =MULTIPOLYGON((（113.257628,23.153067,113.259066,23.151372,113.260521,23.152228,113.259928,23.15364,113.257628,23.153067,)));!\n" +
            "JiaoTong0102;交通;JTT公路—客运站;广州;天河汽车客运站;hotareapolygon =MULTIPOLYGON((（113.348185,23.178258,113.347367,23.175916,113.349388,23.175517,113.350691,23.176115,113.348185,23.178258,)));!\n" +
            "JiaoTong0104;交通;JTT公路—客运站;广州;芳村汽车客运站;hotareapolygon =MULTIPOLYGON((（113.240765,23.086764,113.242912,23.086498,113.242589,23.082957,113.240379,23.083182,113.240765,23.086764,)));!\n" +
            "JiaoTong0114;交通;JTT公路—收费站;广州;广园收费站;hotareapolygon =MULTIPOLYGON((（113.364705,23.153233,113.368711,23.15227,113.367705,23.148565,113.363717,23.148964,113.364705,23.153233,)));!\n" +
            "JiaoTong0115;交通;JTT公路—收费站;广州;三元里收费站;hotareapolygon =MULTIPOLYGON((（113.263113,23.166132,113.260742,23.164005,113.262197,23.162818,113.264829,23.165152,113.263113,23.166132,)));!\n" +
            "JiaoTong0116;交通;JTT公路—收费站;广州;沙贝收费站;hotareapolygon =MULTIPOLYGON((（113.20134,23.161451,113.199391,23.160147,113.201547,23.158195,113.203577,23.159699,113.20134,23.161451,)));!\n" +
            "JiaoTong0128;交通;JTT铁路—铁路（高铁）;广州;广州东站;hotareapolygon =MULTIPOLYGON((（113.329248,23.158854,113.327811,23.155432,113.334027,23.154236,113.334818,23.156562,113.329248,23.158854,)));!\n" +
            "JiaoTong0137;铁路;JTT铁路—铁路（高铁）;铁路;广州南站B2;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0138;铁路;JTT铁路—铁路（高铁）;铁路;广州南站B1;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0139;铁路;JTT铁路—铁路（高铁）;铁路;广州南站1F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0140;铁路;JTT铁路—铁路（高铁）;铁路;广州南站2F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0141;铁路;JTT铁路—铁路（高铁）;铁路;广州南站3F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0155;交通;JTT公路—服务区;河源;热水服务区-向东北;hotareapolygon =MULTIPOLYGON((（114.757443,23.8305,114.751891,23.826335,114.753347,23.825178,114.75773,23.828401,114.757443,23.8305,)));!\n" +
            "JiaoTong0156;交通;JTT公路—服务区;河源;热水服务区-向西南;hotareapolygon =MULTIPOLYGON((（114.756199,23.831801,114.753773,23.83033,114.753935,23.828149,114.758202,23.831314,114.756199,23.831801,)));!\n" +
            "JiaoTong0162;交通;JTT公路—客运站;河源;河源汽车总站;hotareapolygon =MULTIPOLYGON((（114.697614,23.744194,114.699913,23.744211,114.699922,23.743062,114.698656,23.742127,114.697614,23.744194,)));!\n" +
            "JiaoTong0163;交通;JTT公路—服务区;惠州;石坝服务区-向东;hotareapolygon =MULTIPOLYGON((（114.634447,23.528073,114.642765,23.530831,114.641148,23.528255,114.638139,23.52736,114.634447,23.528073,)));!\n" +
            "JiaoTong0164;交通;JTT公路—服务区;惠州;石坝服务区-向西;hotareapolygon =MULTIPOLYGON((（114.634968,23.53103,114.634222,23.528387,114.641903,23.530955,114.639109,23.532173,114.634968,23.53103,)));!\n" +
            "JiaoTong0165;交通;JTT公路—服务区;惠州;泰美服务区-向北;hotareapolygon =MULTIPOLYGON((（114.493881,23.339734,114.495013,23.339775,114.49522,23.335354,114.494097,23.335329,114.493881,23.339734,)));!\n" +
            "JiaoTong0166;交通;JTT公路—服务区;惠州;泰美服务区-向南;hotareapolygon =MULTIPOLYGON((（114.492471,23.339966,114.493603,23.339999,114.493881,23.335885,114.492345,23.335744,114.492471,23.339966,)));!\n" +
            "JiaoTong0175;交通;JTT铁路—铁路（高铁）;惠州;惠州站;hotareapolygon =MULTIPOLYGON((（114.421721,23.158077,114.424461,23.158633,114.424568,23.155875,114.422395,23.155501,114.421721,23.158077,)));!\n" +
            "JiaoTong0176;交通;JTT铁路—铁路（普通火车）;惠州;惠州站;hotareapolygon =MULTIPOLYGON((（114.422374,23.155478,114.422877,23.155619,114.422706,23.156201,114.423596,23.156225,114.423335,23.158227,114.422185,23.157945,114.421979,23.158244,114.421592,23.158095,114.422338,23.155478,114.422374,23.155478,)));!\n" +
            "JiaoTong0181;交通;JTT公路—客运站;惠州;惠州汽车总站;hotareapolygon =MULTIPOLYGON((（114.403765,23.084746,114.404071,23.085319,114.402553,23.086259,114.401834,23.085552,114.401978,23.085203,114.403748,23.084746,114.403765,23.084746,)));!\n" +
            "JiaoTong0182;交通;JTT公路—服务区;江门;梁金山服务区-向东北;hotareapolygon =MULTIPOLYGON((（112.695136,22.460607,112.695531,22.459053,112.688093,22.454377,112.686422,22.455012,112.6951,22.460623,112.695136,22.460607,)));!\n" +
            "JiaoTong0183;交通;JTT公路—服务区;江门;梁金山服务区-向西南;hotareapolygon =MULTIPOLYGON((（112.686171,22.455279,112.686189,22.457417,112.692028,22.461325,112.696052,22.461609,112.686171,22.455263,112.686171,22.455279,)));!\n" +
            "JiaoTong0184;交通;JTT公路—服务区;江门;雅瑶服务区-向北;hotareapolygon =MULTIPOLYGON((（112.997757,22.725013,112.999734,22.724696,112.998548,22.717946,112.996464,22.718163,112.997721,22.725013,112.997757,22.725013,)));!\n" +
            "JiaoTong0185;交通;JTT公路—服务区;江门;雅瑶服务区-向南;hotareapolygon =MULTIPOLYGON((（112.99508,22.726746,112.997416,22.726563,112.99641,22.718929,112.994649,22.719079,112.995044,22.726696,112.99508,22.726746,)));!\n" +
            "JiaoTong0191;交通;JTT公路—客运站;江门;江门汽车客运站;hotareapolygon =MULTIPOLYGON((（113.069152,22.640366,113.067931,22.636496,113.074147,22.635262,113.074542,22.635662,113.071793,22.640599,113.069081,22.640399,113.069152,22.640366,)));!\n" +
            "JiaoTong0195;交通;JTT民航—机场;揭阳;潮汕国际机场;hotareapolygon =MULTIPOLYGON((（116.500222,23.54433,116.509277,23.538631,116.515888,23.545787,116.520919,23.546715,116.527962,23.554798,116.522356,23.559436,116.526524,23.563808,116.526093,23.567518,116.522644,23.569506,116.499934,23.544727,116.500222,23.54433,)));!\n" +
            "JiaoTong0197;交通;JTT公路—服务区;茂名;电白服务区-向西;hotareapolygon =MULTIPOLYGON((（111.062379,21.635767,111.06246,21.63444,111.065847,21.635179,111.065658,21.636288,111.062379,21.635776,111.062379,21.635767,)));!\n" +
            "JiaoTong0198;交通;JTT公路—服务区;茂名;电白服务区-向东;hotareapolygon =MULTIPOLYGON((（111.063394,21.633555,111.065092,21.633917,111.065325,21.634185,111.065218,21.634899,111.06308,21.63442,111.063358,21.633555,111.063394,21.633555,)));!\n" +
            "JiaoTong0202;交通;JTT公路—客运站;茂名;茂名客运中心站;hotareapolygon =MULTIPOLYGON((（110.931604,21.650135,110.933742,21.650001,110.933777,21.65163,110.931622,21.651781,110.931577,21.650135,110.931604,21.650135,)));!\n" +
            "JiaoTong0214;交通;JTT公路—服务区;清远;源潭服务区-向北;hotareapolygon =MULTIPOLYGON((（113.235254,23.688268,113.233799,23.692305,113.23644,23.692554,113.237284,23.690436,113.235272,23.688301,113.235254,23.688268,)));!\n" +
            "JiaoTong0215;交通;JTT公路—服务区;清远;黎溪服务区-向东北;hotareapolygon =MULTIPOLYGON((（113.236497,23.986408,113.236155,23.983569,113.232077,23.979177,113.228466,23.978137,113.236425,23.986441,113.236497,23.986408,)));!\n" +
            "JiaoTong0216;交通;JTT公路—服务区;清远;黎溪服务区-向西南;hotareapolygon =MULTIPOLYGON((（113.233712,23.984592,113.230029,23.984592,113.228322,23.982611,113.229777,23.980184,113.23373,23.984559,113.233712,23.984592,)));!\n" +
            "JiaoTong0224;交通;JTT公路—客运站;清远;清远汽车客运站;hotareapolygon =MULTIPOLYGON((（113.047659,23.691452,113.051917,23.693156,113.052905,23.691254,113.048683,23.689367,113.047605,23.691436,113.047659,23.691452,)));!\n" +
            "JiaoTong0225;交通;JTT公路—收费站;清远;清远西收费站;hotareapolygon =MULTIPOLYGON((（113.032686,23.657571,113.033535,23.657654,113.033724,23.657041,113.032879,23.656876,113.032677,23.657567,113.032686,23.657571,)));!\n" +
            "JiaoTong0231;交通;JTT公路—服务区;汕尾;莲花山服务区-向东;hotareapolygon =MULTIPOLYGON((（115.113282,22.952645,115.114001,22.950448,115.12081,22.950981,115.123702,22.954425,115.113282,22.952694,115.113282,22.952645,)));!\n" +
            "JiaoTong0232;交通;JTT公路—服务区;汕尾;莲花山服务区-向西;hotareapolygon =MULTIPOLYGON((（115.125445,22.957066,115.127215,22.956783,115.120837,22.95368,115.120765,22.955095,115.125418,22.9571,115.125445,22.957066,)));!\n" +
            "JiaoTong0246;交通;JTT铁路—铁路（高铁）;深圳;深圳站;hotareapolygon =MULTIPOLYGON((（114.123341,22.535156,114.122299,22.541431,114.123629,22.541548,114.124204,22.539412,114.125659,22.539429,114.126144,22.537409,114.12512,22.537075,114.125354,22.535339,114.123306,22.535172,114.123341,22.535156,)));!\n" +
            "JiaoTong0247;交通;JTT铁路—铁路（高铁）;深圳;深圳北站;hotareapolygon =MULTIPOLYGON((（114.034221,22.611803,114.029999,22.616007,114.038011,22.61991,114.04076,22.61559,114.034185,22.611803,114.034221,22.611803,)));!\n" +
            "JiaoTong0248;铁路;JTT铁路—铁路（高铁）;铁路;深圳北站-1F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0249;铁路;JTT铁路—铁路（高铁）;铁路;深圳北站1F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0250;铁路;JTT铁路—铁路（高铁）;铁路;深圳北站2F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0253;交通;JTT铁路—铁路（高铁）;深圳;深圳西站;hotareapolygon =MULTIPOLYGON((（113.912788,22.52994,113.912824,22.537017,113.913866,22.53685,113.913866,22.535515,113.916022,22.535014,113.915698,22.532544,113.914045,22.532343,113.913866,22.529973,113.912788,22.52994,113.912788,22.52994,)));!\n" +
            "JiaoTong0257;交通;JTT民航—机场;深圳;宝安国际机场;hotareapolygon =MULTIPOLYGON((（113.81843,22.606632,113.853068,22.62398,113.820442,22.671476,113.789971,22.659604,113.817855,22.606498,113.81843,22.606632,)));!\n" +
            "JiaoTong0258;交通;JTT民航—机场;深圳;宝安国际机场1F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0259;交通;JTT民航—机场;深圳;深圳宝安国际机场2F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0260;交通;JTT民航—机场;深圳;深圳宝安国际机场3F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0261;交通;JTT民航—机场;深圳;深圳宝安国际机场4F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0262;交通;JTT民航—机场;深圳;深圳宝安国际机场5F;hotareapolygon =MULTIPOLYGON((（)));!\n" +
            "JiaoTong0263;交通;JTT公路—客运站;深圳;深圳罗湖汽车客运站;hotareapolygon =MULTIPOLYGON((（114.124712,22.537315,114.126526,22.537582,114.126643,22.535529,114.125026,22.535337,114.124703,22.537307,114.124712,22.537315,)));!\n" +
            "JiaoTong0264;交通;JTT公路—客运站;深圳;深圳福田汽车客运站;hotareapolygon =MULTIPOLYGON((（114.017674,22.537668,114.017171,22.539654,114.023153,22.540472,114.023998,22.53917,114.022579,22.537234,114.01762,22.537668,114.017674,22.537668,)));!\n" +
            "JiaoTong0268;交通;JTT公路—客运站;深圳;深圳市龙岗汽车客运站;hotareapolygon =MULTIPOLYGON((（114.277275,22.730889,114.277913,22.731231,114.278847,22.730064,114.277221,22.729723,114.276637,22.730489,114.277248,22.730906,114.277275,22.730889,)));!\n" +
            "JiaoTong0272;交通;JTT公路—客运站;深圳;深圳汽车站;hotareapolygon =MULTIPOLYGON((（114.095155,22.576554,114.093951,22.57451,114.095775,22.573216,114.097688,22.573992,114.095182,22.576562,114.095155,22.576554,)));!\n" +
            "JiaoTong0273;交通;JTT公路—服务区;阳江;阳江服务区-向东;hotareapolygon =MULTIPOLYGON((（111.95737,21.90973,111.963712,21.911289,111.962652,21.909697,111.959885,21.908774,111.957334,21.909747,111.95737,21.90973,)));!\n" +
            "JiaoTong0274;交通;JTT公路—服务区;阳江;阳江服务区-向西;hotareapolygon =MULTIPOLYGON((（111.957639,21.909814,111.964035,21.911474,111.962328,21.912413,111.958358,21.911608,111.957603,21.909864,111.957639,21.909814,)));!\n" +
            "JiaoTong0278;交通;JTT公路—服务区;云浮;安塘服务区-向东;hotareapolygon =MULTIPOLYGON((（112.18793,22.946535,112.187373,22.944871,112.194165,22.942541,112.195099,22.944039,112.18793,22.946618,112.18793,22.946535,)));!\n" +
            "JiaoTong0279;交通;JTT公路—服务区;云浮;安塘服务区-向西;hotareapolygon =MULTIPOLYGON((（112.187647,22.947159,112.191968,22.945095,112.195696,22.944297,112.194304,22.94552,112.190863,22.94641,112.187656,22.947175,112.187647,22.947159,)));!\n" +
            "JiaoTong0283;交通;JTT水路—港口;湛江;湛江徐闻海安港;hotareapolygon =MULTIPOLYGON((（110.242172,20.27155,110.241359,20.27219,110.24184,20.27269,110.242653,20.272114,110.242181,20.271542,110.242172,20.27155,)));!\n" +
            "JiaoTong0284;交通;JTT水路—港口;湛江;铁路北港;hotareapolygon =MULTIPOLYGON((（110.137389,20.231851,110.137443,20.235717,110.13588,20.235836,110.135898,20.232733,110.136203,20.232139,110.137353,20.2318,110.137389,20.231851,)));!\n" +
            "JiaoTong0292;交通;JTT民航—机场;湛江;湛江机场;hotareapolygon =MULTIPOLYGON((（110.37138,21.204468,110.3629,21.231019,110.369655,21.232299,110.378926,21.20622,110.371308,21.2044,110.37138,21.204468,)));!\n" +
            "JiaoTong0294;交通;JTT公路—服务区;肇庆;龙甫服务区-向南;hotareapolygon =MULTIPOLYGON((（112.723521,23.381566,112.721078,23.380803,112.717125,23.381831,112.715939,23.383424,112.718832,23.383009,112.720844,23.382445,112.723485,23.381599,112.723521,23.381566,)));!\n" +
            "JiaoTong0295;交通;JTT公路—服务区;肇庆;龙甫服务区-向北;hotareapolygon =MULTIPOLYGON((（112.723934,23.381467,112.722856,23.384468,112.719874,23.385132,112.716586,23.38349,112.719946,23.382827,112.72388,23.381433,112.723934,23.381467,)));!\n" +
            "JiaoTong0314;交通;JTT公路—客运站;中山;中山汽车总站;hotareapolygon =MULTIPOLYGON((（113.347574,22.528813,113.347484,22.526226,113.350448,22.526176,113.350412,22.528913,113.347574,22.528796,113.347574,22.528813,)));!\n" +
            "JiaoTong0315;交通;JTT公路—客运站;中山;中山小榄客运站;hotareapolygon =MULTIPOLYGON((（113.264678,22.675703,113.267032,22.677104,113.265055,22.679038,113.263007,22.677054,113.26466,22.675736,113.264678,22.675703,)));!\n" +
            "JiaoTong0319;交通;JTT铁路—铁路（高铁）;珠海;珠海站;hotareapolygon =MULTIPOLYGON((（113.55298,22.220491,113.55289,22.221562,113.553861,22.221679,113.554507,22.222164,113.558963,22.222482,113.559071,22.221913,113.55819,22.220625,113.55298,22.220508,113.55298,22.220491,)));!\n" +
            "JiaoTong0326;交通;JTT公路—客运站;珠海;香洲长途站;hotareapolygon =MULTIPOLYGON((（113.576112,22.284264,113.576543,22.285284,113.574549,22.286756,113.573417,22.286221,113.57286,22.284599,113.576058,22.284247,113.576112,22.284264,)));!";

        var thePointMap = [];
        thePointMap=theRawPointsString.split("!").filter(m=>m!=null&&m.length>0).map(m => m.split(';').filter(n=>n!=null&&n.trim().length>0));

        thePointMap .map(m=>{
            m[5] = m[5].replace("hotareapolygon =MULTIPOLYGON((（", "").replace(")))", "");
            var theInnerPoints = m[5].split(",").filter(t=>t!=null&&t.trim().length>0);
            console.log("长度",theInnerPoints.length);
            var theBaiduPoints=[];
            for(var i=0;i<theInnerPoints.length;i+=2){
                if(i+1>=theInnerPoints.length){
                    continue;
                }
                theBaiduPoints.push([theInnerPoints[i],theInnerPoints[i+1]]);
            }

            AMap.convertFrom(theBaiduPoints, 'baidu', function (status, result) {
                if (result.info === 'ok') {
                    var lnglats = result.locations; // Array.<LngLat>
                    m[5] = lnglats.join(",");

                }
            });
        });

        console.log(thePointMap);

    },
    getPoints() {

    }
}